# GetNormal Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshTopology..::..GetNormal Method
PolymeshTopology Class See Also
---
Returns a normal vector at the given index
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ GetNormal(
	int idx
)
```

Visual Basic
---
```text
Public Function GetNormal ( _
	idx As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetNormal(
	int idx
)
```

# ### Parameters
idx
    Type: System..::..Int32 A zero-based index
# ### Return Value
XYZ value representing a normal vector
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given value is not a valid index of a normal of the polymesh. A valid valure is not negative and is smaller than the number of normals in the polymesh. |

# See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace